hw2_rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G') ORDER BY release_date
---
  def index
    @all_ratings = Movie.all_ratings

    @ratings = params[:ratings] || session[:ratings]
    @sort = params[:sort] || session[:sort]

    unless @ratings
      @ratings = Hash[@all_ratings.map {|rating| [rating, 1]}]

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "movies" SET "title" = 'helloooo', "updated_at" = '2013-07-25 15:47:10.444465' WHERE "movies"."id" = 11
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])